Repository: SebastianoPistore/isoquery
Catalog: man/*.po
Languages: fr

source: Search and display various ISO codes (country, language, ...)
fr: Rechercher et afficher divers codes ISO (pays, langues, etc.)

source: :Date: 2011-06-14 :Version: 1.5 :Manual section: 1
fr: :Date: 14 juin 2011 :Version: 1.5 :Manual section: 1

source: **isoquery** [*options*] [*file*] [*ISO codes*]
fr: **isoquery** [*options*] [*fichier*] [*codes ISO*]

source: This manual page documents briefly the **isoquery** command. It can be used to generate a tabular output of the ISO standard codes provided by the package **iso-codes**. It parses the XML files and shows all included ISO codes or just matching entries, if specified on the command line. Moreover, it's possible to get all available translations for the ISO standard.
fr: Ce manuel décrit brièvement la commande **isoquery**. Elle permet de créer un tableau à partir des codes de la norme ISO fournis dans le paquet **iso-codes**. Elle parcourt les fichiers XML et montre tous les codes ISO ou simplement les entrées correspondantes, si demandées sur la ligne de commande. De plus, toutes les traductions disponibles des normes ISO sont accessibles.

source: This program follows the usual GNU command line syntax, with long options starting with two dashes ('**-**'). **isoquery** supports the following options:
fr: Ce programme suit la syntaxe usuelle des commandes GNU, avec les options longues commençant par deux tirets (« **-** »). **isoquery** prend en charge les options suivantes.

source: -i standard, --iso=standard The ISO standard to use. Possible values: 639, 639-3, 3166, 3166-2, 4217, 15924 (default: 3166).
fr: -i norme, --iso=norme La norme ISO à utiliser. Valeurs disponibles : 639, 639-3, 3166, 3166-2, 4217, 15924 (3166 par défaut).

source: -x file, --xmlfile=file Use another XML *file* with ISO data (default: /usr/share/xml/iso-codes/iso_3166.xml).
fr: -x fichier, --xmlfile=fichier Utiliser un autre *fichier* XML avec les données ISO (/usr/share/xml/iso-codes/iso_3166.xml par défaut).

source: -l locale, --locale=locale Use this *locale* for output.
fr: -l locale, --locale=locale Utiliser cette *locale* pour l'affichage.

source: -n, --name Name for the supplied codes (default).
fr: -n, --name Nom des codes fournis (par défaut).

source: -o, --official_name Official name for the supplied codes. This may be the same as --name (only applies to ISO 3166).
fr: -o, --official_name Nom officiel correspondant aux codes demandés. Il peut être identique à --name. Cette option n'est utile que pour ISO 3166.

source: -c, --common_name Common name for the supplied codes. This may be the same as --name (only applies to ISO 3166).
fr: -c, --common_name Nom courant correspondant aux codes demandés. Il peut être identique à --name. Cette option n'est utile que pour ISO 3166.

source: -0, --null Separate entries with a NULL character instead of newline.
fr: -0, --null Séparer les entrées avec un caractère NULL au lieu d'un retour à la ligne.

source: -h, --help Show summary of options.
fr: -h, --help Afficher un résumé des options.

source: -v, --version Show program version and copyright.
fr: -v, --version Afficher la version du programme et les renseignements de copyright.

source: EXAMPLES
fr: EXEMPLES

source: If called without any command line options, **isoquery** will put out a table of all ISO 3166 codes. The first three columns contain the alpha-2 code, the alpha-3 code, and the numerical code assigned to the country listed in the fourth column.
fr: Si appelée sans option de ligne de commande, **isoquery** affichera toute la table de codes ISO 3166. Les trois premières colonnes contiennent les codes alpha-2, alpha-3 et numérique associés au pays de la quatrième colonne.

source: If you need only some countries, you can specify any of the codes in the first three columns to cut down the output.
fr: Si vous ne voulez que quelques pays, indiquez n'importe quel code des trois premières colonnes afin de restreindre l'affichage.

source: Should you need the translations of the countries' names, just specify in which *locale* you'd like to see the output. Please note that the original English name will be shown if there is no translation available for the specified *locale*.
fr: Si vous voulez la traduction des noms de pays, indiquez simplement la *locale* dans laquelle vous désirez obtenir la sortie. Veuillez remarquer que le nom anglais d'origine sera affiché si aucune traduction n'est disponible pour la *locale* indiquée.

source: $ isoquery --locale=nl fr de es FR FRA 250 Frankrijk DE DEU 276 Duitsland ES ESP 724 Spanje
fr: $ isoquery --locale=fr fr de es FR FRA 250 France DE DEU 276 Allemagne ES ESP 724 Espagne

source: All of the above works for different ISO standards as well, so you can switch to the more extensive standard ISO 3166-2 by using the **--iso** command line option. The columns are country code, subset type (e.g. State, Province, etc.), ISO 3166-2 code, parent, and name. The fourth column (parent) may be empty.
fr: Tout ce qui précède fonctionne aussi pour les différentes normes ISO, ce qui vous permet de basculer vers la norme ISO 3166-2 plus complète en utilisant l'option de ligne de commande **--iso**. Les colonnes contiennent le code de pays, le type de sous-ensemble (par exemple State ou Province), le code ISO 3166-2, le parent et le nom. La quatrième colonne (parent) peut être vide.

source: For ISO 639, the first three columns are the ISO 639 2B code, the ISO 639 2T code and the ISO 639-1 code. The third column may be empty.
fr: Pour ISO 639, les trois premières colonnes contiennent les codes ISO 639 2B, ISO 639 2T et ISO 639-1. La troisième colonne peut être vide.

source: You can trim down the results by specifying only some codes. Moreover, the option to get translated names is also available.
fr: Vous pouvez restreindre l'affichage en indiquant seulement quelques codes. De plus, l'option pour obtenir les noms traduits est disponible.

source: $ isoquery --iso=639 --locale=pt vi bo kl vie vie vi Vietnamita tib bod bo tibetano kal kal kl Kalaallisut; Greenlandic
fr: $ isoquery --iso=639 --locale=fr vi bo kl vie vie vi vietnamien tib bod bo tibétain kal kal kl groenlandais

source: If you want to use ISO 639-3, the displayed columns are id, scope, type, part 1 code, part 2 code, and the language name. Both part 1 and part 2 may be empty.
fr: Pour ISO 639-3, les colonnes affichées sont l'identifiant, le champ d'application, le type, le code ISO 639-1, le code ISO 639-2 et le nom de la langue. Les codes ISO 639-1 et ISO 639-2 peuvent être vides.

source: You can get selected translations of currency names from the ISO 4217 standard by using the following command. The first two columns are the alpha-3 code and the numerical code assigned to the currency.
fr: Vous pouvez obtenir les traductions de noms de monnaie de la norme ISO 4217 en utilisant la commande suivante. Les deux premières colonnes sont les codes alpha-3 et numérique associés à la monnaie.

source: If you need to get script names, you can use the ISO 15924 table. The first two columns are the alpha-4 code and the numerical code assigned to the script.
fr: Le tableau de l'ISO 15924 contient les noms d'écriture. Les deux premières colonnes sont les codes alpha-4 et numérique associés à l'écriture.

source: FILES
fr: FICHIERS

source: By default, the XML files provided by the **iso-codes** package will be used.
fr: Par défaut, les fichiers XML fournis dans le paquet **iso-codes** seront utilisés.

source: AUTHOR
fr: AUTEUR
