Repository: SebastianoPistore/isoquery
Catalog: po/*.po
Languages: cs, da, de, fr, ru, si, sv, vi

source: Usage: %prog [options] [ISO codes]
cs: Používání: %prog [volby] [ISO kódy]
da: Brug: %prog [tilvalg] [ISO-koder]
si: භාතය: %prog [options] [ISO codes]
sv: Användning: %prog [flaggor] [ISO-koder]

source: standard
si: සම්මත

source: The ISO standard to use. Possible values: 639, 639-3, 3166, 3166-2, 4217, 15924 (default: %default).
cs: ISO standard, který se má použít. Možné hodnoty: 639, 639-3, 3166, 3166-2, 4217, 15924. (výchozí: %default).
da: Den ISO-standard der skal bruges. Mulige værdier er: 639, 639-3, 3166, 3166-2, 4217, 15924 (standard: %default).
si: භාවිත කරන ISO සම්මතයන්. විය හැකි අගයන්: 639, 639-3, 3166, 3166-2, 4217, 15924. (පෙරනිමිය: %default)

source: file
cs: soubor
da: fil
si: ගොනුව

source: Use another XML file with ISO data (default: %default).
cs: Použije jiný XML soubor s ISO daty. (výchozí: %default).
da: Brug en anden XML-fil med ISO-data (standard: %default).
si: ISO ගොනුව සමඟ වෙනත් XML ගොනුවක් භාවිත කරන්න (පෙරනිමිය: %default).

source: locale
cs: národní prostředí
da: sprog
si: ප්‍රාදේශිකය

source: Use this locale for output.
cs: Pro výstup použije toto národní prostředí.
da: Brug dette sprog for uddata.
de: Diese Locale für die Ausgabe verwenden.
si: ප්‍රතිදානයට මෙම ප්‍රාදේශිකය භාවිත කරන්න.

source: Name for the supplied codes (default).
cs: Název dodávaných kódů (výchozí).
da: Navn for de angivne koder (standard).
de: Name der übergebenen Codes (Voreinstellung).
si: දෙනලද කේත සඳහා නම (පෙරනිමි).

source: Official name for the supplied codes. This may be the same as --name (only applies to ISO 3166).
cs: Oficiální název dodávaných kódů. Může být stejný jako --name (použije se pouze u ISO 3166).
da: Officielle navne for de angivne koder. Dette kan være det samme som --name (gælder kun for ISO 3166).
de: Offizieller Name der übergebenen Codes. Dies kann das Gleiche sein wie --name (gilt nur für ISO 3166).
si: දෙනලද කේත වල නිල නාමය. මෙය නම --name හා සමාන විය හැක. (ISO 3166 වෙත පමණක් යෙදේ)

source: Common name for the supplied codes. This may be the same as --name (only applies to ISO 3166).
cs: Obecný název dodávaných kódů. Může být stejný jako --name (použije se pouze u ISO 3166).
da: Almindelige navne for de angivne koder. Dette kan være det samme som --name (gælder kun for ISO 3166).
de: Üblicher Name der übergebenen Codes. Dies kann das Gleiche sein wie --name (gilt nur für ISO 3166).
si: දෙනලද කේත වල පොදු නාමය. මෙය නම --name හා සමාන විය හැක. (ISO 3166 වෙත පමණක් යෙදේ)

source: Separate entries with a NULL character instead of newline.
cs: Oddělí položky mezerou namísto nového řádku.
da: Adskilte poster med et NULL-tegn i steden for newline (ny linje).
de: Einträge durch ein NULL-Zeichen anstatt des Zeilenumbruches voneinander trennen.
si: නව පෙළක් වෙනුවට හිස් අක්‍ෂරයක් මගින් ඇතුළත්කිරීම් වෙන් කරන්න.

source: Show summary of options.
cs: Zobrazí přehled voleb.
da: Vis referat over indstillinger.
si: විකල්ප සාරාංශය පෙන්වන්න.

source: Show program version and copyright.
cs: Zobrazí verzi programu a copyright.
da: Vis programversion og ophavsret.
de: Anzeige der Programmversion und des Copyrights.
si: වැඩසටහන් වෙළුම හා හිමිකම් පෙන්වන්න.

source: isoquery: ISO standard '%(standard)s' is not supported.
cs: isoquery: ISO standard '%(standard)s' není podporován.
si: isoquery: '%(standard)s' ISO සම්මතය සහාය නොදක්වයි.
sv: isoquery: ISO-standard "%(standard)s" stöds inte.

source: isoquery: The locale '%(locale)s' is not available for ISO %(standard)s.
cs: isoquery: Národní prostředí '%(locale)s' není pro ISO %(standard)s dostupné.
si: isoquery: ISO %(standard)s සඳහා '%(locale)s' ප්‍රාදේශිකය නොපවතී.
sv: isoquery: Lokalen "%(locale)s" är inte tillgänglig för ISO %(standard)s.

source: Copyright © 2007-2011 Tobias Quathamer
si: හිමිකම © 2007-2011 Tobias Quathamer

source: Translation to LANGUAGE Copyright © YEAR YOUR-NAME
cs: Translation to Czech Copyright © 2010-2011 Michal Šimůnek
da: Oversættelse til dansk ophavsret 2010-2011 Joe Hansen
si: සිංහල වෙත පරිවර්තනය හිමිකම © 2010-2011 ඩනිෂ්ක නවීන්
sv: Översatt till Svenska © 2010 Martin Bagge Skicka synpunkter på översättningen till tp-sv@listor.tp-sv.se.

source: isoquery: The file '%(filename)s' could not be opened.
cs: isoquery: Soubor '%(filename)s' nelze otevřít.
si: isoquery: '%(filename)s' ගොනුව විවෘත කල නොහැක.
sv: isoquery: Filen "%(filename)s" kunde inte öppnas.

source: isoquery: The file '%(filename)s' could not be parsed correctly.
cs: isoquery: Soubor '%(filename)s' nelze zpracovat.
si: isoquery: '%(filename)s' ගොනුව නිවැරදිව විග්‍රහ කල නොහැක.
sv: isoquery: Filen "%(filename)s" kunde inte läsas korrekt.

source: isoquery: The file '%(filename)s' does not contain valid ISO %(standard)s data.
cs: isoquery: Soubor '%(filename)s' neobsahuje platná ISO %(standard)s data.
si: isoquery: '%(filename)s' ගොනුව සතුව වලංගු ISO %(standard)s දත්ත නොපවතී.
sv: isoquery: Filen "%(filename)s" innehåller inte korrekt formaterad ISO %(standard)s data.

source: isoquery: The code '%(code)s' is not defined in ISO %(standard)s.
cs: isoquery: Kód '%(code)s' není v ISO %(standard)s definován.
si: isoquery: ISO %(standard)s හි '%(code)s' කේතය යොදා නොමැත.
sv: isoquery: Koden "%(code)s" finns inte definierad i ISO %(standard)s.

source: isoquery: ISO standard "%(standard)s" is not supported.
da: isoquery: ISO-standard »%(standard)s« er ikke understøttet.
de: isoquery: Der ISO-Standard »%(standard)s« wird nicht unterstützt.

source: isoquery: The locale "%(locale)s" is not available for ISO %(standard)s.
da: isoquery: Sproget »%(locale)s« er ikke tilgængelig for ISO %(standard)s.

source: Copyright © 2007-2012 Tobias Quathamer
da: Ophavsret 2007-2012 Tobias Quathamer

source: isoquery: The file "%(filename)s" could not be opened.
da: isoquery: Filen »%(filename)s« kunne ikke åbnes.
de: isoquery: Die Datei »%(filename)s« konnte nicht geöffnet werden.

source: isoquery: The file "%(filename)s" could not be parsed correctly.
da: isoquery: Filen »%(filename)s« kunne ikke fortolkes korrekt.
de: isoquery: Die Datei »%(filename)s« konnte nicht korrekt ausgewertet werden.

source: isoquery: The file "%(filename)s" does not contain valid ISO %(standard)s data.
da: isoquery: Filen »%(filename)s« indeholder ikke gyldig ISO %(standard)s-data.
de: isoquery: Die Datei »%(filename)s« enthält keine gültigen ISO %(standard)s Daten.

source: isoquery: The code "%(code)s" is not defined in ISO %(standard)s.
da: isoquery: Koden »%(code)s« er ikke defineret i ISO %(standard)s.
de: isoquery: Der Code »%(code)s« ist in ISO %(standard)s nicht definiert.

source: The ISO standard to use. Possible values: 639, 639-3, 3166, 3166-2, 4217, 15924. Default value: %default
sv: ISO-standard att använda. Möjliga värden:: 639, 639-3, 3166, 3166-2, 4217, 15924. Standardvärde: %default

source: FILE
de: DATEI
sv: FIL

source: Use specified XML file with ISO data. Default value: %default
sv: Använd angiven XML-fil med ISO-data. Standardvärde: %default

source: LOCALE
ru: ЛОКАЛЬ
sv: LOKAL
vi: MIỀN ĐỊA PHƯƠNG

source: Use this locale for output
fr: Utiliser ces paramètres régionaux (« locale ») pour la réponse
ru: Использовать данную локаль при выводе
sv: Använd denna lokal för utdata
vi: Dùng miền địa phương này cho kết xuất

source: Display the name for the supplied codes (default)
sv: Visa namn för angivna koder (standard)

source: Display the official name for the supplied codes. This may be the same as --name. (Only applies to ISO 3166)
sv: Visa officiellt namn för angivna koder. Detta kan vara samma som --name. (Gäller endast ISO 3166)

source: Display the common name for the supplied codes. This may be the same as --name. (Only applies to ISO 3166)
sv: Visa generellt namn för angivna koder. Detta kan vara samma som --name. (Gäller endast ISO 3166)

source: Separate entries with a NULL character instead of newline
fr: Séparer les entrées avec un caractère NULL au lieu d'un retour à la ligne
ru: Разделять элементы символом NULL, а не символом новой строки
sv: Separera enheter med NULL
vi: Định giới các mục nhập bằng một ký tự vô giá trị (NULL) thay cho một ký tự dòng mới

source: Show this information
sv: Visa denna information

source: Show program version and copyright
fr: Afficher la version du programme et les informations de copyright
ru: Показать версию программы и инф. об авторском праве
sv: Visar programversion och infomation om upphovsrätt
vi: Hiển thị phiên bản chương trình và tác quyền

source: Translation to LANGUAGE Copyright © YEAR YOUR-NAME
de: Deutsche Übersetzung Copyright © 2007-2014 Tobias Quathamer
fr: Traduction française Copyright © 2007-2014 Christian Perrier
ru: Перевод на русский Copyright © 2010-2014 Юрий Козлов
vi: Bản dịch tiếng Việt của Clytie Siddall (tác quyền © 2010 của Tổ chức Phần mềm Tự do)

source: The ISO standard to use. Possible values: 639, 639-3, 3166, 3166-2, 4217, 15924 (default: 3166).
de: Der gewünschte ISO-Standard. Mögliche Werte: 639, 639-3, 3166, 3166-2, 4217, 15924 (Voreinstellung: 3166).

source: Use another XML file with ISO data (default: /usr/share/xml/iso-codes/iso_3166.xml)
de: Eine andere XML-Datei mit ISO-Daten verwenden (Voreinstellung: /usr/share/xml/iso-codes/iso_3166.xml)

source: Run "isoquery --help" to see a full list of available command line options.
de: Rufen Sie »isoquery --help« auf, um eine Liste aller Befehlszeilenoptionen angezeigt zu bekommen.
fr: Utilisez « isoquery --help » pour afficher la liste complète des options possibles.
ru: Запустите «isoquery --help», чтобы увидеть полный список доступных параметров командной строки.

source: isoquery: Internal error. Please report this bug.
de: isoquery: Interner Fehler. Bitte berichten Sie diesen Fehler.

source: The file "%s" does not contain valid ISO %s data.
fr: Le fichier « %s » ne contient pas de données ISO-%s valables.
ru: Файл «%s» не содержит допустимых данных ISO %s.
vi: Tập tin « %s » không chứa dữ liệu ISO %s đúng.

source: The ISO standard to use. Possible values: 639-2, 639-3, 639-5, 3166-1, 3166-2, 3166-3, 4217, 15924 (default: 3166-1)
fr: Norme ISO à utiliser. Valeurs possibles : 639-2, 639-3, 639-5, 3166-1, 3166-2, 3166-3, 4217, 15924. Valeur par défaut : 3166-1
ru: Использовать стандарт ISO. Возможные значения: 639-2, 639-3, 639-5, 3166-1, 3166-2, 3166-3, 4217, 15924 (по умолчанию: 3166-1)
vi: Tiêu chuẩn ISO cần dùng. Giá trị có thể là: 639-2, 639-3, 639-5, 3166-1, 3166-2, 3166-3, 4217, 15924. Giá trị mặc định: 3166-1

source: STANDARD
fr: NORME
ru: СТАНДАРТ
vi: TIÊU CHUẨN

source: Name for the supplied codes (default)
fr: Nom correspondant au code demandé (défaut)
ru: Показать имена имеющих кодов (по умолчанию)

source: Official name for the supplied codes. This may be the same as --name (only applies to ISO 3166-1)
fr: Retourner le nom officiel correspondant au code demandé. Cette valeur peut être identique à --name. Cette option n'est utile que pour ISO 3166-1
ru: Показать официальные имена имеющих кодов. Может быть тоже, что и с --name (применимо только к ISO 3166-1)
vi: Hiển thị tên chính thức cho mã được cung cấp. Giá trị này có thể trùng với « --name ». (Chỉ áp dụng cho ISO 3166-1)

source: Common name for the supplied codes. This may be the same as --name (only applies to ISO 3166-1)
ru: Показать общие имена имеющих кодов. Может быть тоже, что и с --name (применимо только к ISO 3166-1)
vi: Hiển thị tên chung cho mã được cung cấp. Giá trị này có thể trùng với « --name ». (Chỉ áp dụng cho ISO 3166-1)

source: [ISO codes]
fr: [codes ISO]
ru: [коды ISO]

source: ISO standard "%s" is not supported.
fr: norme ISO « %s » non gérée.
ru: Стандарт ISO «%s» не поддерживается.
vi: Tiêu chuẩn ISO « %s » không phải được hỗ trợ.

source: The code "%s" is not defined in ISO %s.
fr: Le code « %s » n'existe pas dans ISO-%s.
ru: Код «%s» не определён в ISO %s.
vi: Mã « %s » không phải được xác định trong ISO %s.

source: Copyright © 2007-2016 Dr. Tobias Quathamer
vi: Tác quyền © năm 2007-2016 của Dr. Tobias Quathamer
